<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 会话设置
// +----------------------------------------------------------------------

return [
    'id'             => '',
    'var_session_id' => '',             // SESSION_ID的提交变量,解决flash上传跨域
    'prefix'         => 'admin',        // SESSION 前缀
    'type'           => '',             // 驱动方式 支持redis memcache memcached
    'expire'         => 60 * 60 * 12,   // session过期时间
    'auto_start'     => true,           // 是否自动开启 SESSION
];
